<template>

  <v-row
    class = 'fill-height'
    align="center"
    justify="center"
    >
    <vue-headful title = 'THUPC2021 报名系统'></vue-headful>
    <v-col>
      <v-card
        class = 'mx-auto'
        width="800px"
        >
        <v-card-title class = 'primary--text'>报名条款</v-card-title>
        <v-card-text>
          <vue-markdown
            mode = 'viewer'
            :source = 'agreement'
            >
          </vue-markdown>
        </v-card-text>
      </v-card>
    </v-col>
  </v-row>
  
</template>

<script>
import VueMarkdown from 'vue-markdown';

export default {
  name: 'Agreement',
  components: {
    VueMarkdown,
  },
  data() {
    return {
      agreement: `
# 总则

在注册账号之前，请仔细阅读本协议，注册即表明同意本协议。

清华大学程序设计竞赛暨高校邀请赛（下简称清华校赛，校赛或 THUPC），由清华大学计算机系主办，清华大学计算机系学生算法与竞赛协会（简称清华算协或算协）承办，是一个主要面向大学、高中的算法爱好者的赛事。

# 服务内容

THUPC 为参赛选手提供线上和线下比赛服务，包括活动策划组织、题目命制、平台开发维护、比赛相关问题答疑等。我们会尽力提供服务，但不保证服务一定满足选手的所有要求，也不对服务的持续性、及时性做出保证。

# 选手账户

## 队伍账号与权限

为了向选手顺利提供服务，注册队伍账号时需要提供注册页面要求的信息（包括但不限于队伍名称，用户姓名或名称，用户邮箱，用户手机号，用户收货地址等）；在特定情况下（例如法律规定或相关政策需要，如参加线下比赛等）选手需要填写真实的身份信息。特别提醒队伍账号由队内选手共有，应妥善保管帐号密码等重要信息。因保管不善等导致遭受盗号或密码失窃的后果，责任由队伍选手自行承担。

我们十分重视选手个人信息的保密性和安全性，具体请参阅隐私政策章节。

## 隐私政策

### 个人信息

队伍注册账号参赛时，需要向我们提供的关于选手的信息，可能包括但不限于选手个人姓名、邮箱、性别、就读院校等个人信息。

我们尽力把个人信息的收集范围控制在为满足商业和法律法规要求，为特定的本产品的行为所需要的范围之内。

### 我们将如何使用这些信息

当队伍注册账号参加线上比赛时，我们将通过填写的邮箱对选手的身份进行验证，邮箱可用于接受赛事相关信息及比赛合作方的相关资讯。

参加线下比赛时，为了可以顺利到场参加比赛，我们需要获取选手的真实个人姓名等信息进行登记备案。

按照赛事的相关需求，我们可能会要求选手对填写的就读院校等信息进行核实。

### 与合作方分享

我们与比赛合作方可能共享选手通过本网站填写的信息。

如果我们向比赛合作方分享和披露选手的个人信息：

1. 合作方接收者应以保密的方式处理个人信息，并采取充分的安全措施保护信息不受损失、滥用、未经授权的访问或披露、修改及破坏；
2. 我们仅为满足收集时已说明的目的向合作方披露和分享其需要的个人信息。

# 诚信守则公约

诚信比赛，从我做起，参赛选手务必仔细阅读并遵守以下参赛诚信守则。

参加THUPC，以下内容将视为是您的承诺：

- 仅凭自己队内成员完成所有题目与代码。所有参赛队伍都必须独立参与比赛，我们将使用一切可能的手段（包括但不限于代码查重等）来检查作弊行为；
- 一个队伍仅持有一个帐号，并且不会让其他人使用队伍帐号及密码；
- 不从事任何可能不诚实地提高自己成绩，或不正当影响他人成绩的行为；

如果我们认为参赛队伍在比赛过程中出现了不诚实的行为，我们有权取消该队伍的成绩、后续参赛及获奖资格。

# 附则

本协议的拟定及执行均适用于中华人民共和国法律。

清华大学计算机算法与竞赛协会在法律范围内保留对活动的解释权
      `
    }
  }
}
</script>
